perpendicular-flap/OpenFOAM-CalculiX/Fluid/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "precice-config.xml";

participant Fluid;

modules (FSI);

interfaces
{
  Interface1
  {
    mesh              Fluid-Mesh-Faces;
    patches           (flap);
    locations         faceCenters;
    
    readData
    (
    );
    
    writeData
    (
      Forces0
    );
  };
  
  Interface2
  {
    mesh              Fluid-Mesh-Nodes;
    patches           (flap);
    locations         faceNodes;
    
    readData
    (
      Displacements0
    );
    
    writeData
    (
    );
  };
};

FSI
{
  rho rho [1 -3 0 0 0 0 0] 1;
}